app/views/carts/_shopcart.html.erb

<% if session[:cart_id].nil?  %>
  <%@cart= Cart.create%>
---
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Tue, 18 Sep 2012 17:10:42 UTC +00:00], ["updated_at", Tue, 18 Sep 2012 17:10:42 UTC +00:00]]