app/controllers/carts_controller.rb

SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT 1  [["id", "24"]]
---
  def show
    begin

     @cart = Cart.find(params[:id])

SELECT "carts".* FROM "carts" WHERE "carts"."id" = ? LIMIT 1  [["id", "38"]]
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 38]]
---
  def destroy
    @cart = Cart.find(params[:id])
    @cart.destroy