app/controllers/line_items_controller.rb

SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "116"]]
INSERT INTO "line_items" ("cart_id", "created_at", "order_id", "product_id", "quantity", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["cart_id", 24], ["created_at", Wed, 05 Sep 2012 03:03:11 UTC +00:00], ["order_id", nil], ["product_id", 118], ["quantity", 1], ["updated_at", Wed, 05 Sep 2012 03:03:11 UTC +00:00]]
UPDATE "line_items" SET "quantity" = 2, "updated_at" = '2012-09-05 03:02:28.665568' WHERE "line_items"."id" = 37
---
  def create
     authorize! :read, @line_items
    @cart = current_cart
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id)

    respond_to do |format|
      if @line_item.save

SELECT "line_items".* FROM "line_items" WHERE "line_items"."id" = ? LIMIT 1  [["id", "49"]]
DELETE FROM "line_items" WHERE "line_items"."id" = ?  [["id", 49]]
---
  def destroy
     # authorize! :delete, @line_items
    @line_item = LineItem.find(params[:id])
    @line_item.destroy