app/controllers/products_controller.rb

  def index

   if params[:search].present?
        @products = Product.paginate(:per_page => 12, :page => params[:page]).find_all_by_name(params[:search])
    else

    @products = Product.paginate(:per_page => 12, :page => params[:page]).all
     end

     # if params[:category].present?
#
      # @category = params[:category]
      # @products = @category.products
      # else
      # @products = Product.all
     # end

    @categories = Category.all
---
SELECT "products".* FROM "products" WHERE "products"."name" = 'simplehuman' LIMIT 12 OFFSET 0
SELECT COUNT(*) FROM "products" WHERE (name LIKE '%%')
SELECT "products".* FROM "products" LIMIT 8 OFFSET 0
SELECT COUNT(*) FROM "products"
SELECT "categories".* FROM "categories"