app/views/products/index.html.erb

<div class="box-content">
<% categories = Category.all %>
---
SELECT "categories".* FROM "categories"